package com.zhcs.utils.strRandom;

import java.util.Random;

//*****************************************************************************
/**
 * <p>Title:StdRandom</p>
 * <p>Description:随机数生成器</p>
 * <p>Copyright: Copyright (c) 2017</p>
 * <p>Company: 深圳市智慧城市管家信息科技有限公司</p>
 * @author 刘晓东 - Alter
 * @version v1.0 2017年2月23日
 */
//*****************************************************************************
public final class StdRandom {
    
    /**隨機數生成器*/
    private static Random random;
    
    /**種子值*/
    private static long seed;
    
    //靜態代碼塊，初始化種子值以及隨機數生成器
    static {
        seed = System.currentTimeMillis();
        random = new Random(seed);
    }
    
    //*************************************************************************
    /**
    * 构造函数 私有構造函數，靜止實例化
    */
    //*************************************************************************
    private StdRandom() {}
    
    //*************************************************************************
    /** 
    * 【設置】設置種子值
    * @param s  
    */
    //*************************************************************************
    public static void setSeed(long s){
        seed = s;
        random = new Random(seed);
    }
    
    //*************************************************************************
    /** 
    * 【取得】取得種子值
    * @return  
    */
    //*************************************************************************
    public static long getSeed(){
        return seed;
    }
    
    //*************************************************************************
    /** 
    * 【取得】隨機返回0到1之間的實數
    * @return  
    */
    //*************************************************************************
    public static double uniform(){
        return random.nextDouble();
    }
    
    //*************************************************************************
    /** 
    * 【取得】隨機返回0到N-1之間的實數[0,N)
    * @param N
    * @return  
    */
    //*************************************************************************
    public static int uniform(int N){
        return random.nextInt(N);
    }
    
    //*************************************************************************
    /** 
    * 【取得】隨機返回0到1之間的實數 [0,1)
    * @return  
    */
    //*************************************************************************
    public static double random(){
        return uniform();
    }
    
    //*************************************************************************
    /** 
    * 【取得】隨機返回a到b-1之前的整數[a,b)
    * @param a 下限
    * @param b 上限
    * @return  
    */
    //*************************************************************************
    public static int uniform(int a,int b){
        return a + uniform(b - a);
    }
    
    //*************************************************************************
    /** 
    * 【取得】隨機返回a到b之間的實數
    * @param a
    * @param b
    * @return  
    */
    //*************************************************************************
    public static double uniform(double a,double b){
        return a + uniform() * (b - a);
    }
}